"""Даний список чисел. Визначте, скільки в цьому списку елементів, які більше двох своїх сусідів (ліворуч і праворуч),
та виведіть кількість таких елементів. Крайні елементи списку ніколи не враховуються, оскільки вони мають недостатньо
сусідів."""

a = [15, 30, 15, 140, 120, 100, 110, 109, 200, 1000]
count = 0   # вводим 0 для нашего счетчика чисел(count), которые больше соседей
x, y = 0, 2     # индексы соседей чисел в списке(при первом проходе цикла for)
print(a)
for i in a[1:-1]:   # срез убирает 0 и последнее значение списка
    if i > a[x] and i > a[y]:
        count += 1
    x += 1
    y += 1
print(count)