"""Програма запитує введення послідовності цілих невід'ємних чисел, доки не буде введено 0. Як тільки
буде введено 0 (нуль), програма повинна порахувати та вивести на екран:
- кількість введених чисел (завершальний 0 не рахується)
- їхню суму
- добуток
- середнє арифметичне (крім завершального числа 0)
- Визначити значення та порядковий номер найбільшого елемента послідовності. Якщо найбільших елементів є кілька,
виведіть порядковий номер першого з них. Нумерація елементів починається з 1 (однини)
- визначити кількість парних та непарних елементів у послідовності
- Визначити значення другого за величиною елемента в цій послідовності
- визначте, скільки елементів цієї послідовності дорівнюють її найбільшому елементу"""

count = 0
sum = 0
mult = 1
max2 = -1
n = -1
even = 0
odd = 0
maximum = 0
num_maximal = 0



n = int(input("Enter number:"))
max1 = n
while n != 0:
    count += 1
    sum += n
    mult *= n
    avr = float(sum/count)
    n = int(input("Enter number:"))
    if n > maximum:
        maximum, num_maximal = n, 1
    elif n == maximum:
        num_maximal += 1

    if n > max1:
        max2 = max1
        max1 = n
    elif n > max2:
        max2 = n
    if n % 2 == 0:
        even += 1
    if n % 2 != 0:
        odd += 1

print("Количество введеных чисел:", count)
print("Сумма введеных чисел =", sum)
print("Произведение введеных чисел =", mult)
print("Среднее арифметическое =", avr)
print("Наибольший элемент последовательности =", max1 )
print("Количество парных=", even, "количество не парных =", odd)
print("значення второго за величиною =", max2)
print("Количество наибольших элементов =", num_maximal)